#include<stdio.h>
int main() 
{
	int a = 10, b = 20;
	//1.表达式
	/*a + b
	a / b
	a % b*/
	//简单表达式：a、b、c
	//复杂表达式：2*(a+b)/10+a*b

	//2.语句：以分号结束
	//空语句
	//{}括起来叫做语句块
	{
		int a = 1, b = 2;
		;;;;
		;
		printf("a=%d,b=%d\n", a, b);
	}
	printf("a=%d,b=%d\n", a, b);

	//3.运算符
	//赋值运算符,从右向左赋值
	//变量名、指针=常量表达式、变量
	//初始化：定义变量的时候给初值
	//赋值：变量已经定义好了，只是改变变量的值
	//赋值的时候发生隐式类型转换
	float f = 45.6;//45.6默认是double，第一种隐式类型转换，大杯子水倒进小杯子，较长数据转换为较短数据，会发生截断，会警告
	int c = 'c';//第二种隐式类型转换，较小的数据转化为较大的数据,小杯子水倒进大杯子，类型提升，不会警告
	//赋值的时候发生显示类型转换,不会发生警告
	//float f = (float)45.6;
	//算数运算符：
	//单目运算符：（+、-、++、--）
	//双目运算符：符号两边要有两个操作数（+、-、*、/）
	int aa = 46, bb = 4, cc = 0;
	float dd = 0;
	cc = aa / bb;
	printf("cc=%d\n", cc);//11?如果操作数两边都是同一种类型，算出来结果是同一种类型
	float d = 3.0f;
	dd = aa / d;
	printf("dd=%f\n", dd);
	float e = aa / bb;
	printf("e=%f\n", e);
	float ee = (float)aa / bb;
	printf("ee=%f\n", ee);
	//%求余，两边操作数只能是整数,余数的正负取决于被除数
	int ff = aa % bb;
	printf("ff=%d\n", ff);
	//前置++（--）：++a,表示先自增自减，再赋值
	cc = ++aa;
	printf("aa=%d,++aa=%d\n",aa, cc);
	//后置++（--）：a++,表示先赋值,后自增自减
	cc = bb++;
	printf("bb=%d,bb++=%d\n",bb, cc);
	//++和--的优先级高于+、-、*、/
	//先看优先级，再看结合性
	//a=45,c=--a+a++,c=88,a=45

	return 0;
}