#include<stdio.h>
int main() 
{
	int a[4] = { 1,2,3,4 };
	int* ptr1 = (int*)(&a + 1);//数组地址加一强制转换成整形指针
	int* ptr2 = (int*)((int)a + 1);//首元素地址移动一个字节
	//小端存储模式：01 00 00 00 02 00 00 00 03 00 00 00 04 00 00 00
	//00 00 00 02
	printf("%x,%x\n", ptr1[-1], *ptr2);//4,2000000
	//*(ptr1+(-1))=*(ptr1-1)：0x00000004
	//0x02000000
	
	int b[3][2] = { (0,1),(2,3),(4,5) };//逗号表达式，存进数组里的是1,3,5
	int* p;
	p = b[0];
	printf("%d\n", p[0]);//1

	int c[5][5];
	int(*p2)[4];
	p2 = (int(*)[4])c;
	printf("%p,%d\n", &p2[4][2] - &c[4][2], &p2[4][2] - &c[4][2]);//p[4][2]==(*(p+4)+2)

	return 0;
}