#include "core.h"


整形 主函数()
开始
	//关键字32个
	//常量：在程序运行过程当中值不可以发生改变的量 45;78;'A';'&';"hello"

	//整形常量： 45；78
	//十进制整形常量:%d
	//八进制整形常量:前缀0 %o
	//十六进制整形常量:前缀0x或者0X %x
	//进制转换：
	//其他进制，短除法
	//十进制转二进制
	//十进制转十六进制
	//十进制转八进制
	//279(10) => 100010111(2)
	printf("%#o\n", 072);
	printf("%d\n", 072);
	printf("%#x\n", 0x45);
	printf("%d\n", 0x45);
	//浮点型常量：0.1
	//十进制小数：3.14 %f默认六位,%m.nf:m表示输出宽度，超过则全部显示，不够则会在前面空出 n:保留小数位数
	//用科学计数法表示浮点型常量：3.14 *10^2=3.14e（E）2；
	printf("%6.1f\n", 3.14);
	printf("%f\n", 3.14E-2);
	//字符型常量：'A';'&'
	//a-z,A-Z,0-9.!,@,#,$,%,^……
	//区分大小写
	//单引号里不能为空
	//%c
	//转义字符'\':\'单引号 \"双引号 \n换行符 \r回车符 \t制表符 \a响铃 \0字符串终止符 \\反斜杠 \ddd八进制数所代表的字符 \xhh十六进制所代表的字符
	//%是格式控制符，要%%
	printf("%c\n", 'a');
	printf("%d\n", 'a');
	printf("\a\t%c\n", '\'');
	printf("%c\n", '\75');
	printf("%c\n", '\x2f');
	printf("%%\n");
	//字符串常量："12345";"hello"
	//""空串
	//"2345645dadadw31124!@!#\n\n\a12"
	//字符串的长度：字符的个数
	//"helloworld\r"：11
	//空字符串长度为0，占用内存一个字节，包含字符串终止符\0
	printf("");
	printf("2345645dadadw31124!@!#\n\n\a12\n");
	int n = strlen("helloworld\r");
	printf("长度为：%d\n", n);
	//符号常量(宏定义)：PI
	//#define PI 3.14
	//#define Y 2020
	//#define CH 'A'
	//#define HELLO "helloworld"
	float s = 2 * PI;
	printf("s=%f\n", s);
	printf("年份是%d\n", Y);
	printf("成绩是%c\n", CH);
	printf("%s\n", HELLO);
	打印("这是一个c语言程序\n");

	返回 0;
结束